#ACL ESTANDAR NUMERADA#

Router(config)#access-list 1 permit 192.168.10.0 0.0.0.255 

#ACL ESTANDAR NOMBRADA#

Router(config)#ip access-list standard FILTRO_LAN
Router(config-std-nacl)#permit 192.168.10.0 0.0.0.255

#ACL EXTENDIDA NUMERADA#

Router(config)#access-list 100 permit tcp 192.168.10.0 0.0.0.255 any eq 80

#ACL EXTENDIDA NOMBRADA#

Router(config)#ip access-list extended FILTRO_WEB
Router(config-ext-nacl)#permit tcp 192.168.10.0 0.0.0.255 any eq  80

#ASOCIAR UNA ACL A UNA INTERFAZ#

Router(config)#interface fastEthernet 0/0
Router(config-if)#ip access-group 100 in
Router(config-if)#exit
